#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time: 2023/4/26 10:23
# @Author: 白云苍狗
# @File: 03- 元组的相对不可变性.py
# @Software: PyCharm

"""
元组的相对不可变性：元组的值会随着引用的可变对象而变，元组中永远不变的是项的标识。
    1. 元组与多数Python容器(列表、字典、集合等)一样，存储的是对象的引用。
    2. 如果引用的项是可变的，即便元组本身不可变，项依然可以更改。
    3. 元组的不可变性其实是指tuple数据结果的物理内容(即存储的引用)不可变，与引用的对象无关。
"""

t1 = (1, 2, [30, 40])
t2 = (1, 2, [30, 40])
print(t1 == t2)  # True
print(id(t1[-1]))  # 2282528760704
t1[-1].append(99)
print(t1)  # (1, 2, [30, 40, 99])
print(id(t1[-1]))  # 2282528760704
print(t1 == t2)  # False
